#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли; 
	
	Если НЕ Отказ И Замещение И ЭтотОбъект.Количество() = 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ВладелецРасписания", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ВладелецРасписания.Значение), ЭтотОбъект.Отбор.ВладелецРасписания.Значение, ""));
			Запрос.УстановитьПараметр("ПлановаяДата", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ПлановаяДата.Значение),  ЭтотОбъект.Отбор.ПлановаяДата.Значение, ""));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыРасписаний.ВладелецРасписания,
			|	ДатыРасписаний.ПлановаяОперация
			|ИЗ
			|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
			|ГДЕ
			|	(&ВладелецРасписания = """"
			|			ИЛИ ДатыРасписаний.ВладелецРасписания = &ВладелецРасписания)
			|	И (&ПлановаяДата = """"
			|			ИЛИ ДатыРасписаний.ПлановаяДата = &ПлановаяДата)
			|	И ДатыРасписаний.ПлановаяОперация <> Неопределено";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.ВладелецРасписания) И ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
					Запись = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
					Запись.Шаблон   = Выборка.ВладелецРасписания;
					Запись.Операция = Выборка.ПлановаяОперация;
					Запись.Прочитать();
					Если Запись.Выбран() Тогда
						Запись.Удалить();
					КонецЕсли; 
				КонецЕсли; 
			
			КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	СписокОпераций = Новый Массив;
	
	Если НЕ Отказ И ЭтотОбъект.Количество() > 0 Тогда
		
		Для Каждого ЗаписьЭтогоОбъекта Из ЭтотОбъект Цикл
			
			Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.АктуальнаяДата) И ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ПлановаяОперация) Тогда
				ЗаписьОперацииШаблона = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
				ЗаписьОперацииШаблона.Шаблон       = ЗаписьЭтогоОбъекта.ВладелецРасписания;
				ЗаписьОперацииШаблона.Операция     = ЗаписьЭтогоОбъекта.ПлановаяОперация;
				ЗаписьОперацииШаблона.ПлановаяДата = ЗаписьЭтогоОбъекта.ПлановаяДата;
				ЗаписьОперацииШаблона.Записать(Истина);
				Если ЗаписьЭтогоОбъекта.ВладелецРасписания <> ЗаписьЭтогоОбъекта.ПлановаяОперация Тогда
					СписокОпераций.Добавить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла; 
		
		// Поскольку операции добавлены в даты шаблона, они не могут оставаться запланированными без шаблона
		ПлановыеОперации.УдалитьДатуОперацийЗапланированныхБезШаблона(СписокОпераций);
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
