////////////////////////////////////////////////////////////////////////////////
// ПоддержкаПользователейДеньгиКлиентСервер
//
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет правильность записи регистрационного номера программы
//
//Параметры:
//	Номер	- Строка - проверяемый регистрационный номер
//
//Возвращаемое значение:
//	Булево - Истина, если номер записан правлильно, и ЛОЖЬ в ином случае
//
Функция РегистрационныйНомерСоответствуетМаске(Знач Номер) Экспорт

	Если ТипЗнч(Номер) <> Тип("Строка") Или  ПустаяСтрока(Номер)
		Или СтрДлина(Номер) < 10 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер) 

КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти