#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ЗапуститьОбменИнтерактивно(СтруктураПараметров, Адрес = Неопределено) Экспорт

	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Не Режим = "ЦентрМобильных" Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняем обмен
	ОбменМобильноеПриложение.ВыполнитьОбменДаннымиПоСценариюТранспортаОбмена(СтруктураПараметров.Транспорт);

КонецПроцедуры

#КонецОбласти


#КонецЕсли
