
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриЗаписи(Отказ)
	
	СинхронизацияАвтономныхКопий.ОпределитьФункциоанльныеОпцииЭтойБазы(ЭтотОбъект.Значение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ОбменСЦентральнойБазой") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДеньгиОбменСЦентральнойБазой");
		Модуль.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(
				ЭтотОбъект.Значение = Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли