&НаСервере
Функция ПолучитьКлючЗаписи(Узел)
	Возврат РегистрыСведений.ПараметрыСинхронизацииАвтономныхКопий.СоздатьКлючЗаписи(Новый Структура("Узел", Узел));
КонецФункции 


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписи(ПараметрКоманды));//Новый Структура("Ключ", Новый РегистрСведенийКлючЗаписи.ПараметрыСинхронизацииАвтономныхКопий(Узел));
	ОткрытьФорму("РегистрСведений.ПараметрыСинхронизацииАвтономныхКопий.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
